---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningRemovesHost
source: html/626e64a6-4a04-06e7-0532-d1306276ac7c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningRemovesHost Property

Opening completely removes its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningRemovesHost { get; }
```